In [1]:
# start with imports
import pandas as pd
# pip install pandas

In [3]:
# try this:
ufo_dataframe = pd.read_csv('../data/ufo.csv') # mac or linux
# pd.read_csv(r'..\data\ufo.csv') # windows

In [11]:
# show the first 5 rows of your dataframe:
ufo_dataframe.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
# what object type is our df?
type(ufo_dataframe)

pandas.core.frame.DataFrame

In [14]:
# what about the last few rows?
ufo_dataframe.tail(4)

               City Colors Reported Shape Reported State           Time
80539  Uhrichsville             NaN          LIGHT    OH  9/5/2014 1:14
80540        Tucson        RED BLUE            NaN    AZ  9/5/2014 2:40
80541   Orland park             RED          LIGHT    IL  9/5/2014 3:43
80542      Loughman             NaN          LIGHT    FL  9/5/2014 5:30

In [22]:
# what if I just want a random sample of rows?
print(ufo_dataframe.sample(3))
ufo_dataframe.sample(3, random_state=(42))

                  City Colors Reported Shape Reported State             Time
9588      Fort Collins             NaN          LIGHT    CO  8/24/1996 21:00
79832  Monroe Township          ORANGE       FIREBALL    NJ   8/8/2014 21:15
31650           Blaine            BLUE            NaN    MN  1/28/2005 18:00

            City Colors Reported Shape Reported State             Time
14733  Clackamas           GREEN       FIREBALL    OR  10/3/1999 21:40
21696    Phoenix             NaN         CIRCLE    AZ  3/20/2002 20:50
72078      Drums             NaN       FIREBALL    PA  8/24/2013 20:45

In [23]:
# how big is my dataframe?
ufo_dataframe.shape # rows and columns

(80543, 5)

In [25]:
# what are the column (variable) names?
ufo_dataframe.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [26]:
# this is a python "variable" aka an object.
x = 55
type(x)

In [30]:
# this is a pandas "variable" aka a Series or a column.
type(ufo_dataframe['State'])

pandas.core.series.Series

In [38]:
# show me some hi-level stats about my dataframe.
myresults = ufo_dataframe.describe()
myresults

           City Colors Reported Shape Reported  State            Time
count     80496           17034          72141  80543           80543
unique    13504              31             27     52           68901
top     Seattle          ORANGE          LIGHT     CA  7/4/2014 22:00
freq        646            5216          16332  10743              45

In [34]:
# now we want to save our results!
myresults.to_csv('../data/myresults.csv')

## Let's try this some more

In [36]:
# try a new file:
baseball = pd.read_csv('../data/hitters.csv')
baseball.head()

,AtBat,Hits,HmRun,Runs,RBI,Walks,Years,CAtBat,CHits,CHmRun,CRuns,CRBI,CWalks,League,Division,PutOuts,Assists,Errors,Salary,NewLeague
0,293,66,1,30,29,14,1,293,66,1,30,29,14,A,E,446,33,20,NaN,A
1,315,81,7,24,38,39,14,3449,835,69,321,414,375,N,W,632,43,10,475.0,N
2,479,130,18,66,72,76,3,1624,457,63,224,266,263,A,W,880,82,14,480.0,A
3,496,141,20,65,78,37,11,5628,1575,225,828,838,354,N,E,200,11,3,500.0,N
4,321,87,10,39,42,30,2,396,101,12,48,46,33,N,E,805,40,4,91.5,N

In [41]:
# describe your data
bb_results = baseball.describe()

In [44]:
# output these results as a new csv
type(baseball)
type(bb_results)
bb_results.to_csv('../data/bb_results.csv')

In [53]:
new_results = pd.read_csv('../data/bb_results.csv', sep=',')

In [51]:
# try a tab-separated file:
df = pd.read_csv('../data/movie_ratings.tsv', sep='\t', 
                 names=['min', 'reviews', 'stars', 'something'])
df.head()

   min  reviews  stars  something
0  196      242      3  881250949
1  186      302      3  891717742
2   22      377      1  878887116
3  244       51      2  880606923
4  166      346      1  886397596

In [57]:
# try reading a json file format:
df2 = pd.read_json('../data/yelp.json', lines=True)
df2.sample(3)

,business_id,date,review_id,stars,text,type,user_id,votes
1079,YKOvlBNkF4KpUP9q7x862w,2011-11-04,OmcoLT0j_RrCuU3cl_BdVw,4,There's a lot to love about The Mission. The ...,review,fiyOnIEKBOgj00NJLwDBVg,"{'funny': 4, 'useful': 5, 'cool': 5}"
368,hWhVP-28LYP3llaMlAJ_JA,2010-09-13,DYhwTfyy6PIHgc13K_ZjJA,5,"Definitely one of my favorite places to eat, h...",review,dGfOZWZbYaoTlFiW8EnAFw,"{'funny': 0, 'useful': 0, 'cool': 0}"
9176,fP-BPL6iRu2tbcvlnjRshw,2011-07-07,nai7U95Uq3fBqQY-OyMi_Q,4,Finally another downtown lunch option. I'm vi...,review,vhxFLqRok6r-D_aQz0s-JQ,"{'funny': 1, 'useful': 1, 'cool': 1}"

In [60]:
# you can also read files directly from the internet as follows:
my_url="https://raw.githubusercontent.com/austinlasseter/plotly_dash_tutorial/master/00%20resources/titanic.csv"

In [61]:
# now read the url
df3 = pd.read_csv(my_url)
df3.tail(3)

     Unnamed: 0  Survived  Pclass     Sex   Age   Fare     Embarked
709         887         1       1  female  19.0  30.00  Southampton
710         889         1       1    male  26.0  30.00    Cherbourg
711         890         0       3    male  32.0   7.75   Queenstown

## Let's also learn to find files on my machine

In [62]:
# import two new libraries
import os
from pathlib import Path

In [64]:
# what is my current working directory?
home_dir = Path.cwd()

In [65]:
# what's in that directory?
os.listdir(home_dir)

['01-practice-reading-data.ipynb',
 '01-classnotes.ipynb',
 '.ipynb_checkpoints',
 'my_results.csv',
 '02-intro-to-pandas.ipynb']

In [70]:
# what's the dir above that dir?
print(home_dir)
print(home_dir.parent)
print(home_dir.parent.parent)
print(home_dir.parent.parent.parent)

/Users/austinlasseter/atelier/generalassembly/python-2-dc/07-pandas-intro/code
/Users/austinlasseter/atelier/generalassembly/python-2-dc/07-pandas-intro
/Users/austinlasseter/atelier/generalassembly/python-2-dc
/Users/austinlasseter/atelier/generalassembly

In [71]:
# where is my data stored?
os.listdir(home_dir.parent)

['code', 'slides', 'README.md', '.gitignore', '.git', 'data']

In [72]:
# build a new path to your data folder
data_path = Path.joinpath(home_dir.parent, 'data')
print(data_path)

/Users/austinlasseter/atelier/generalassembly/python-2-dc/07-pandas-intro/data

In [81]:
# what's in my data file?
os.listdir(data_path)
print(data_path)

/Users/austinlasseter/atelier/generalassembly/python-2-dc/07-pandas-intro/data

In [74]:
# FINALLY: build a cast-iron path to my data.
ufo_path = Path.joinpath(home_dir.parent, 'data', 'ufo.csv')

In [75]:
# now i can read that using pandas:
df = pd.read_csv(ufo_path)

In [77]:
df = pd.read_csv('/Users/austinlasseter/atelier/generalassembly/python-2-dc/07-pandas-intro/data/ufo.csv')

In [78]:
df.head('../data/ufo.csv')

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [92]:
for file in os.listdir(data_path):
    try:
        if file[-4:]=='.csv':
            
            print(file)
        
#         df = pd.read_csv(file)
#         print(df.columns)
    except:
        pass

old-faithful.csv
collegeadmissions.csv
msleep.csv
myresults.csv
Production.ProductSubcategory.csv
drinks.csv
imdb_1000.csv
oracle_10k.csv
drinks_updated.csv
airlines.csv
ozone.csv
vti.csv
ufo.csv
rossmann-stores.csv
Sales.SalesOrderHeader.csv
titanic.csv
wine.csv
student_comments.csv
haystack.csv
drones.csv
mtcars.csv
bikeshare.csv
hitters.csv
features.csv
NBA_players_2015.csv
Sales.SalesOrderDetail.csv
Production.Product.csv
bb_results.csv
bank-additional.csv
vehicles_train.csv
vehicles_test.csv
stores.csv